Data1/Ux273.25Uy6.94/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../system/parameters.cs"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $T;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $T;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $T;
        value           uniform $T;

    }

    sides
    {
        type            inletOutlet;
        inletValue      uniform $T;
        value           uniform $T;

    }

    rocket
    {
    type            zeroGradient;
    value           uniform $T;

    }
}

// ************************************************************************* //
