Data1/Ux273.25Uy6.94/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../system/parameters.cs"
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($Ux $Uy $Uz);

boundaryField
{
    inlet
    {
	    type            freestreamVelocity;
        pInf            $P;
        TInf            $T;
        UInf            ($Ux $Uy $Uz);
        gamma           1.4;
        value           uniform ($Ux $Uy $Uz);
        freestreamValue           uniform ($Ux $Uy $Uz);

    }

    outlet
    {
	    type            freestreamVelocity;
        pInf            $P;
        TInf            $T;
        UInf            ($Ux $Uy $Uz);
        gamma           1.4;
        value           uniform ($Ux $Uy $Uz);
        freestreamValue           uniform ($Ux $Uy $Uz);
    }

    sides
    {
	    type            freestreamVelocity;
        pInf            $P;
        TInf            $T;
        UInf            ($Ux $Uy $Uz);
        gamma           1.4;
        value           uniform ($Ux $Uy $Uz);
        freestreamValue           uniform ($Ux $Uy $Uz);

    }

    rocket
    {
        type            noSlip;
    }
}

// ************************************************************************* //
