Data1/Ux273.25Uy6.94/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.1; // calculates how fast turbulent kinetic energy is dissipated into heat.

boundaryField
{
    inlet
    {
	 type            fixedValue;
        value           uniform 0.1;
            }
    outlet
    {
        type 		inletOutlet;
        inletValue	 uniform 0.1;      
    }
    sides
    {
         type 		inletOutlet;
        inletValue	 uniform 0.1;          
    }
    rocket
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
