Data1/Ux273.25Uy6.94/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../system/parameters.cs"

dimensions      [0 2 -2 0 0 0 0];

k   0.01;//#calc "1.5 * pow((0.05 * sqrt(pow($Ux * 1.0,2) + pow($Uy * 1.0,2) + pow($Uz * 1.0,2))),2)";


internalField   uniform $k; // describes turbulence kinetic energy

boundaryField
{
    inlet
    {
         type            fixedValue;
        value           uniform $k;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $k;
        value           uniform $k;

    }
    sides
    {
        type            inletOutlet;
        inletValue      uniform $k;
        value           uniform $k;

    }
    rocket
    {
        type            kqRWallFunction;
        value           uniform $k;
    }
}


// ************************************************************************* //
