Data1/Ux273.25Uy6.94/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../system/parameters.cs"


dimensions      [0 2 -1 0 0 0 0];

k   #calc "1.5 * pow((0.05 * sqrt(pow($Ux * 1.0,2) + pow($Uy * 1.0,2) + pow($Uz * 1.0,2))),2)";

LengthScale 0.03;

omega #calc "0.09 * pow($k,0.5) / $LengthScale";

nut 0;//#calc " $k / $omega";


internalField   uniform $nut;// describes turbulence diffusion

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform $nut;
    }
    outlet
    {
        type            calculated;
        value           uniform $nut;
    }
    sides
    {
        type            calculated;
	value           uniform $nut;
    }
    rocket
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
}


// ************************************************************************* //
