Data1/Ux273.25Uy6.94/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
    location    "0";
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


#include "../system/parameters.cs"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $P;

boundaryField
{
    inlet
    {
    type            freestreamPressure;
    freestreamValue uniform $P;
    }

    outlet
    {
            type            freestreamPressure;
        freestreamValue uniform $P;
        /*
        type            waveTransmissive;
        field           p;
        gamma           1.4;
        fieldInf        101325;
        lInf            1;
        value           uniform 101325;
        */
    }

    sides
    {
    type            freestreamPressure;
    freestreamValue uniform $P;
    }

    rocket
    {
        type            zeroGradient;
	value           uniform $P;
    }
}

// ************************************************************************* //
