Data1/Ux273.25Uy6.94/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Description: BlockMesh dictionary for a rocket mesh.
// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source: C:\Users\pdh24\Desktop\Concordia Classes\Rockets\blend\CR-25 medium mesh.blend
// Export date: 2024-08-17 23:51:38.113671

#include "../system/parameters.cs"  // Include external parameters for flexibility

// Overall scaling factor for the mesh
scale 1.0;


yzPlaneProportion #calc "($yzMargin * 1.0) / ($yMax * 1.0)";
yzPlaneRemaining #calc "(1.0 - $yzPlaneProportion) / 2.0";

// Grading factor
reciprocalGradingFactor #calc "1.0 / $gradingFactor";

// Compute total cells in x, y, z directions
numCellsX #calc "round(($xMax - $xMin) / $cellSize)";
numCellsY #calc "round(($yMax - $yMin) / $cellSize)";
numCellsZ #calc "round(($zMax - $zMin) / $cellSize)";

// Total length in x-direction
totalLengthX #calc "($xMax - $xMin) * 1.0";


// Proportions for front, mid, and back sections
frontProportion #calc "((-1.0 * $xMin) - $marginLength) / $totalLengthX";
midProportion #calc "(($lengthRocket + $marginLength + $marginLength) * 1.0) / $totalLengthX";
backProportion #calc "(($xMax - $lengthRocket - $marginLength) * 1.0) / $totalLengthX";

// Grading calculations for front, mid, and back sections
numCellsFront #calc "1 + (log($gradingFactor * 1.0) / log(1.0 - ($cellSize * $gradingFactor / ((-1.0 * $xMin) - $marginLength))) * (1.0 - $gradingFactor))";
numCellsMid #calc "(($lengthRocket + $marginLength + $marginLength) * 1.0) / ($cellSize / $gradingFactor)";
numCellsBack #calc "1 + (log($gradingFactor * 1.0) / log(1.0 - ($cellSize * $gradingFactor / (($xMax - $lengthRocket - $marginLength)))) * (1.0 - $gradingFactor))";

// Grading calculations for y-direction
numCellsY1 #calc "1 + (log($gradingFactor * 1.0) / log(1.0 - (($cellSize / $gradingFactor) / ($yMax * (1.0 - $yzPlaneProportion))) * (1.0 - $gradingFactor)))";
numCellsYfocus #calc "(($yMax * $yzPlaneProportion) * 2.0) / ($cellSize / $gradingFactor)";

// Logging important parameters
/*
#message "============================================================================";
#message "Mesh Proportions:";
#message "Front Proportion = $frontProportion";
#message "Mid Proportion = $midProportion";
#message "Back Proportion = $backProportion";
#message "Total Length X = $totalLengthX";
#message "============================================================================";

#message "Cell Distribution:";
#message "Number of Cells in Front = $numCellsFront";
#message "Number of Cells in Mid = $numCellsMid";
#message "Number of Cells in Back = $numCellsBack";
#message "Number of Cells Y1 = $numCellsY";
#message "Number of Cells Y2 = $numCellsYfocus";
#message "============================================================================";
*/
// Mesh vertices
vertices
(
    ($xMin $yMin $zMin)    // Vertex 0: Bottom-left corner
    ($xMax $yMin $zMin)    // Vertex 1: Bottom-right corner
    ($xMax $yMax $zMin)    // Vertex 2: Top-right corner
    ($xMin $yMax $zMin)    // Vertex 3: Top-left corner
    ($xMin $yMin $zMax)    // Vertex 4: Bottom-left corner (top surface)
    ($xMax $yMin $zMax)    // Vertex 5: Bottom-right corner (top surface)
    ($xMax $yMax $zMax)    // Vertex 6: Top-right corner (top surface)
    ($xMin $yMax $zMax)    // Vertex 7: Top-left corner (top surface)
);

// Block definitions with grading
blocks
(
    hex (0 1 2 3 4 5 6 7) ($numCellsX $numCellsY $numCellsZ) simpleGrading (
                                                    (
                                                     ($frontProportion  $numCellsFront $reciprocalGradingFactor)
                                                     ($midProportion $numCellsMid 1.0)
                                                     ($backProportion $numCellsBack $gradingFactor)
                                                    )
                                                    (
                                                     ($yzPlaneRemaining $numCellsY1 $reciprocalGradingFactor) 
                                                      ($yzPlaneProportion $numCellsYfocus 1.0) 
                                                      ($yzPlaneRemaining $numCellsY1 $gradingFactor)
                                                    )
                                                    (
                                                     ($yzPlaneRemaining $numCellsY1 $reciprocalGradingFactor) 
                                                      ($yzPlaneProportion $numCellsYfocus 1.0) 
                                                      ($yzPlaneRemaining $numCellsY1 $gradingFactor)
                                                    )
                                                )
);

// No curved edges in this mesh
edges
(
);

// Boundary conditions
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)  // Front face
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)  // Back face
        );
    }

    sides
    {
        type patch;
        faces
        (
            (3 7 6 2)  // Right side
            (1 5 4 0)  // Left side
            (0 3 2 1)  // Bottom side
            (4 5 6 7)  // Top side
        );
    }
);
