Data1/Ux273.25Uy6.94/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "parameters.cs"

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.001;  // 
        nPreSweeps      5;
        nPostSweeps     3;
        nFinestSweeps   3;
        cacheAgglomeration true;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        minIter         3;

    }

    "(U|h|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.0;   // 
        minIter         3;

    }

    "(k|omega|nut)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;   //  Looser tolerance for turbulence fields (helps stability)
        minIter         3;

    }
}



SIMPLE
{
    residualControl
    {
        p               1e-6;
        U               1e-6;
        "(k|omega|e)"   1e-5;
    }

    nNonOrthogonalCorrectors 1;
    consistent yes;
    transonic yes;
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 4;
    nCorrectors     5;
    nNonOrthogonalCorrectors 2;
    pMinFactor      0.5;
    pMaxFactor      2;
}


relaxationFactors
{
    fields
    {
        p               0.2;
        U               0.4;
        T               0.4;
        rho             0.01;
    }
    equations
    {
        //U               0.1;
        //e               0.1;
        //h               0.1;
        //"(k|omega|nut)" 0.1;
        "."             0.2;
    }
}