Data1/Ux273.25Uy6.94/system/snappyHexMeshDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}




// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: C:\Users\pdh24\Desktop\Concordia Classes\Rockets\blend\CR-25 medium mesh.blend
// Export date: 2024-08-18 19:03:03.953247

// Details about SnappyHexMesh parameters can be found in annotated caseDicts:
// - For openfoam.org (development version), see
//   https://github.com/OpenFOAM/OpenFOAM-dev/blob/master/etc/caseDicts/annotated/snappyHexMeshDict
// - For openfoam.com (development version), see
//   https://develop.openfoam.com/Development/openfoam/-/blob/master/etc/caseDicts/annotated/snappyHexMeshDict
// See also links in https://openfoamwiki.net/index.php/SnappyHexMesh

#include "parameters.cs";

stlFile "RocketV5.stl";
eMeshFile "RocketV5.eMesh";


//stlFile "rocket.stl";
//eMeshFile "rocket.eMesh";



castellatedMesh true;
snap            true;
addLayers       false;

mergePatchFaces false;  // Avoid face merging to increase layer coverage

geometry
{
    rocket
    {
        type triSurfaceMesh;
        file $stlFile;
        // Min Bounds = [ 9.50825e-07 -7.36521e-02 -1.24298e-01]
        // Max Bounds = [ 3.23994e+00  1.41840e-01  1.24298e-01]
        // Area = 1.14863e+00
    }
}

castellatedMeshControls
{
    maxLocalCells   1000000;
    maxGlobalCells  20000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.1;
    nCellsBetweenLevels 1;
    locationInMesh (-1 -1 -1);
    allowFreeStandingZoneFaces true;
    resolveFeatureAngle 130;
    // useLeakClosure true; // OpenFOAM.com option
    handleSnapProblems true;
    useTopologicalSnapDetection true;

    features
    (
        {
            file $eMeshFile;
            level 7;
        }

    );

    refinementSurfaces
    {
        rocket
        {
            level (5 6);
            patchInfo { type wall; }
            
        }

    }

    refinementRegions
    {
        rocket
        {
            mode distance;
            levels $refinementRegionsLevels;
        }

    }
}

snapControls
{
    nSmoothPatch 15;
    nSmoothInternal 1; // OpenFOAM.com option
    tolerance 1.0;
    nSolveIter 30;
    nRelaxIter 20;
    nFeatureSnapIter 20;
    implicitFeatureSnap true;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
    nFaceSplitInterval -1; // OpenFOAM.com option
    releasePoints false;  // multi-region related option
    stringFeatures true;
    avoidDiagonal false;
    strictRegionSnap false;
    concaveAngle 45;
    minAreaRatio 0.3;
}

addLayersControls
{
    // If 'true', thickness parameters (firstLayerThickness, minThickness, etc.)
    // are interpreted as a fraction of the local background cell size.
    // If 'false', they're treated as absolute distances in SI units (meters).
    relativeSizes true;

    // The fraction by which each subsequent layer grows
    expansionRatio 1.2;

    // The thickness of your first boundary-layer cell, relative to local cell size
    // if relativeSizes = true; or absolute thickness if relativeSizes = false.
    firstLayerThickness 0.1;

    // If snappy can't achieve at least this fraction/absolute thickness,
    // it won't add a layer. (Again depends on 'relativeSizes'.)
    minThickness 0.01;

    // If initial layer insertion fails on a cell, snappy tries to grow from
    // neighboring cells up to nGrow layers away. Helps fill small misses.
    nGrow 0;

    // Controls how snappy identifies 'sharp' features to preserve or refine
    featureAngle 140;

    // (OpenFOAM.com) merges patch faces that meet at < this angle
    mergePatchFacesAngle 45;

    // (OpenFOAM.com) stops layering if extruded faces bend more than this angle
    layerTerminationAngle 55;

    // Ensures the new layer face thickness doesn't exceed some fraction of
    // the underlying cell face thickness. Helps control extreme aspect ratios.
    maxFaceThicknessRatio 0.5;

    // If set to 'true', snappy won't add layers at edges. 
    // Setting to 'false' tries to add them if possible.
    disableWallEdges true;

    // Smoothing of surface normals before and after layer addition
    nSmoothSurfaceNormals 4;
    nSmoothNormals 5;

    // Number of iterations to smooth out the layer thickness distribution
    nSmoothThickness 15;

    // Number of iterations to smooth the displacement vector field
    // used for layer extrusion
    nSmoothDisplacement 25;

    // (Advanced) Max iterations for medial axis analysis. 
    // The medial axis helps ensure layers don't overlap or blow up near tight curvatures.
    nMedialAxisIter 1000;

    // Minimum angles used in the medial axis analysis
    minMedianAxisAngle 90;
    minMedialAxisAngle 90;

    // Allows layers to be up to this fraction of the local distance to the medial axis
    maxThicknessToMedialRatio 0.5;

    // Another angle for advanced slip features
    slipFeatureAngle 30;

    // After failing or partial layering, tries relaxing constraints up to these iterations
    nRelaxIter 5;

    // The main layering loop tries up to nLayerIter times to inflate layers each pass
    nLayerIter 10;

    // Additional 'relaxed' passes (some parameters are eased) up to nRelaxedIter times
    nRelaxedIter 5;

    // (OpenFOAM.com) The outer layering loop can repeat up to nOuterIter passes 
    // if layers keep failing. A high number helps, but increases runtime.
    nOuterIter 8;

    // More verbose printouts in the log (helpful for debugging)
    additionalReporting false;

    // If > 0, snappy sets aside these cells from extrusion
    nBufferCellsNoExtrude 0;

    // Patch-specific layer settings go inside 'layers {}'
    layers
    {
        // For patch named "rocket" (must match your STL patch or region name)
        rocket
        {
            // Target number of layers on this patch
            nSurfaceLayers 3;

            // Optionally, you can override the global defaults (expansionRatio, etc.)
            expansionRatio 1.2;
            firstLayerThickness 0.1;
        }
    }
}


meshQualityControls
{
    // Maximum non-orthogonality allowed. 
    maxNonOrtho 65;  // Relaxed from 75 to 65 (common default)

    // Max skewness allowed.
    maxBoundarySkewness 10;  // Typical default for boundary faces
    maxInternalSkewness 3;   // Common value for internal skewness

    // Max concaveness allowed. 
    maxConcave 70;  // Standard value for moderate concave faces

    // Minimum projected area v.s. actual area. 
    minFlatness 0.5;  // Relaxed for general meshing; lower precision required

    // Minimum cell pyramid volume relative to min bounding box length^3.
    minVol 1e-30;  // Default is slightly lower for more flexibility

    // Minimum quality of tetrahedral cells.
    minTetQuality 1e-15;  // Relaxed from stricter stability (e.g., 1e-12)

    // Minimum face twist. Ensures cells are not overly twisted.
    minTwist 0.05;  // Loosened to allow slightly more twist (default range: 0.01-0.05)

    // Minimum normalized cell determinant.
    minDeterminant 0.01;  // Relaxed determinant for near-degenerate cells

    // Minimum face weight.
    minFaceWeight 0.08;  // Relaxed from 0.01 to prioritize mesh generation

    // Minimum volume ratio.
    minVolRatio 0.02;  // Typical for maintaining balanced cell sizes

    // Additional parameters (default: ignored if -1)
    minArea -1;          // Disable area checks (not commonly used)
    minTriangleTwist -1; // Disable triangle twist checks (not commonly used)

    // Advanced settings
    nSmoothScale 4;       // Reset to typical default for smoothing iterations
    errorReduction 0.75;  // Retain error reduction for balance

    relaxed
    {
          maxNonOrtho 70;
          maxConcave 80;
    }
}


writeFlags      ( scalarLevels layerSets layerFields );

mergeTolerance  1e-06;

    // Maximum non-orthogonality allowed. 